# LineSupportSegment

Line support on segment

## Properties

Name | Type | Description | Notes
------------ | ------------- | ------------- | -------------
**id** | **int** | Element Id | [optional]

## Example

```python
from ideastatica_rcs_api.models.line_support_segment import LineSupportSegment

# TODO update the JSON string below
json = "{}"
# create an instance of LineSupportSegment from a JSON string
line_support_segment_instance = LineSupportSegment.from_json(json)
# print the JSON string representation of the object
print(LineSupportSegment.to_json())

# convert the object into a dict
line_support_segment_dict = line_support_segment_instance.to_dict()
# create an instance of LineSupportSegment from a dict
line_support_segment_from_dict = LineSupportSegment.from_dict(line_support_segment_dict)
```
[[Back to Model list]](../README.md#documentation-for-models) [[Back to API list]](../README.md#documentation-for-api-endpoints) [[Back to README]](../README.md)